Revit 2027 API
BuiltInFailures.StairRampFailures.TreadDepthBelowMin Property
 The Actual Tread Depth for one or more Stairs violates the Minimum Depth set in the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TreadDepthBelowMin { get; }
Public Shared ReadOnly Property TreadDepthBelowMin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TreadDepthBelowMin {
	FailureDefinitionId^ get ();
}
static member TreadDepthBelowMin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace